import streamlit as st


# Intro
st.title("هل يستاهل ننقل لمدينة الرياض عشان نتوظف؟")
with st.container():
    st.html('''<p dir="rtl" >اولًا, نلاحظ زيادة عدد سكان الرياض صح؟
طيب ليه؟ طبعًا عشان الوظائف, الكل صار وده يجي الرياض عشان الفرص العظيمة اللي فيها وعدد الشركات العالمية اللي صارت الرياض مقر اقليمي لها! وهذا شيء عظيم وانجاز نفتخر فيه,
  طبعًا جميع ماذكرت عبارة عن كلام لا اكثر لكن اعرف انت ياللي تقرا تدور ارقام, وحقائق, وبيانات تستند عليها, ومحد بيقدر يكذبك 
😎.</p> 
''')

# 1
with st.container():
    st.html('''<p dir="rtl" ><strong>مبدئيًا عشان نجاوب على سؤالنا الرئيسي, وين تتمركز الوظائف في المملكة العربية السعودية؟ 
🤔</strong></p> 
''')
    st.image('images/regions_graph.png', width=700)
    st.html('''<p dir="rtl" >كما ترى عزيزي القارئ اعلاه, الرياض تحتل المركز الاول واعلى عدد من الشواغر في المملكة وبفارق كبير عن باقي المناطق.
والسبب هو انها العاصمة وهو شيء بديهي وطبيعي جدًا ان  العاصمة يتوفر فيها الوظائف آكثر من باقي المدن لكن ما يميزها هي المزايا الاقتصادية الاستراتيجية والحيوية على مستوى المملكة وتستند الرؤية المستقبلية الى جعل المنطقة متعددة الوظائف الاقتصادية, وجاذبة للاستثمار وهذا ما نراه في الفترة الاخيرة, وتكون ذات تنمية متوازنة مكانيُا  
💪🔥.</p> 
''')

# 2
with st.container():
    st.html('''<p dir="rtl" ><strong>ولا يضيق صدرك يا خريج ما نسيناك😉
</strong></p> 
''')
    st.image('images/freshers_graph.png')
    st.html('''<p dir="rtl" ><strong>عزيزي الخريج🎓, كما يتضح اعلاه ان الرياض لازالت لديها اكبر حصة من الوظائف في المملكة, لان الحضور الحكومي لديها اكثر من باقي المناطق, ويقصد بهذا العديد من الوزارات والهيئات الحكومية ومقرها الرئيسي هو الرياض وهذا الشيء يتطلب طلب كبير للمواهب الشابة في الادوار الادارية والتقنية وباقي المجالات
وكما ذكرنا تعدد الشركات في الرياض وتعتبر الرياض مركز تجاري رئيسي لعديد منا لشركات المحلية والعالمية مما يوفر فرص في التمويل.</strong></p> ''')

# 3
with st.container():
    st.html('''<p dir="rtl" ><strong>ودك تعرف احجام الشركات في مناطق المملكة؟🧐
</strong></p> 
''')
    st.image('images/comp_graph.png')
    st.html('''<p dir="rtl" >عزيزي المتطلع 👀, بينما ان الرياض تعتبر اكثر منطقة لديها اكبر عدد من السكان والنشاط الاقتصادي, ادى ذلك الى الطلب على الشركات من جميع الاحجام, ويسمح للشركات الصغيرة الازدهار بجانب الشركات الاكبر منها, وتلبية احتياجات السوق والمتخصصة او تقديم خدمات متخصصة, موقع الرياض الاستراتيجي جعلها جذابة للشركات التي تتطلع الى خدمة الاسواق المحلية والاقليمية, تشجع هذه الميزة الشركات ذات الاحجام المختلفة على تأسيس وجود لها بالمنطقة
    .</p> 
''')
# 4
with st.container():
    st.html('''<p dir="rtl" ><strong>الفلووس
</strong></p> 
''')
    st.image('images/avg_graph.png')
    st.html('''<p dir="rtl" >
            والله شوف عزيزي.. كما يتضح لكم بالرسم البياني اعلاه, ان النتيجة كانت عكس التوقعات, توقعنا ان بيكون متوسط الرواتب بالرياض اكثر لكن لربما بسبب ضعف البيانات المتوفرة لم يظهر لنا الارقام الحقيقية للرواتب ,
            لا نعتقد انها صحيحة بسبب الاتي, تكلفة المعيشة في منطقة الرياض اعلى نسبيًا مقارنة بباقي المدن الاخرى في المملكة العربية السعودية, والمفترض ان تظهر البيانات رواتب اعلى للتعويض عن ارتفاع تكلفة المعيشة,
            ايضًا الطلب العالي على المهارات والمؤهلات مرتفع في مدينة الرياض ويؤدي الى رفع مستويات الرواتب ذوي المهارات المطلوبة,
            بالاضافة الى النشاط الاقتصادي في مدينة الرياض كما ذكرنا مسبقًا, ويساهم هذا في رفع متوسط الرواتب بسبب زيادة العمل.
            💸🤑💰</p> 
''')
    
# Conclusion
with st.container():
    
    st.html('''<p dir="rtl" >
         في الختام اعزائي, قد يكون الانتقال الى الرياض شيء مفيد ويعتمد على اهدافك وتفضيلاتك المهنية, لدى الرياض سوق متنوع وفرص في مختلف الصناعات ورواتب تنافسية في قطاعات معينة, رغم ذلك يجب ان تكون تكلفة المعيشة وتغيير نمط الحياة في عين الاعتبار, فالرياض اقتصاد نابض بالحياة, مدعوم بالمبادرات الحكومية والقطاع الخاص, بيئة مناسبة للتطوير المهني والابتكار!</p> 
''')





